app/controllers/api/categories_controller.rb

  def show
    # Get all formations that belongs to this category
    @formations = Array.new
    @category_formations = FormationCategory.where(category_id: @category.id)
    @category_formations.each do |category_formation|
      @formations << category_formation.formation
---
SELECT "formation_categories".* FROM "formation_categories" WHERE "formation_categories"."category_id" = $1  [["category_id", 4]]
SELECT "formation_categories".* FROM "formation_categories" WHERE "formation_categories"."formation_id" = $1  [["formation_id", 3]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "formations de merde"], ["created_at", "2020-11-30 15:50:47.533570"], ["updated_at", "2020-11-30 15:50:47.533570"]]