app/controllers/api/formation_sessions_controller.rb

  def index
    @formation_sessions = Formation.find(params[:formation_id]).formation_sessions
---
SELECT "formation_sessions".* FROM "formation_sessions" WHERE "formation_sessions"."formation_id" = $1  [["formation_id", 1]]
SELECT "formations".* FROM "formations" WHERE "formations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @formation_session = FormationSession.new(formation_session_params)

    if @formation_session.save
---
INSERT INTO "formation_sessions" ("start_date", "end_date", "capacity", "room_id", "formation_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"