app/controllers/api/formation_categories_controller.rb

  def create
    @formation_category = FormationCategory.new(formation_category_params)

    if @formation_category.save
---
INSERT INTO "formation_categories" ("formation_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["formation_id", 1], ["category_id", 1], ["created_at", "2020-11-30 16:30:41.398931"], ["updated_at", "2020-11-30 16:30:41.398931"]]

    def set_formation_category
      @formation_category = FormationCategory.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]