app/controllers/api/formations_controller.rb

INSERT INTO "formations" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "next"], ["description", "c'est aussi de la merde"], ["created_at", "2020-11-30 15:31:36.040370"], ["updated_at", "2020-11-30 15:31:36.040370"]]
---
  def create
    @formation = Formation.new(formation_params)

    if @formation.save