app/controllers/api/formation_attendances_controller.rb

  def index
    @formation_attendances = FormationAttendance.all
---
SELECT "formation_attendances".* FROM "formation_attendances"

  def create
    @formation_attendance = FormationAttendance.new(formation_attendance_params)
    @formation_attendance.user_id = current_user.id
    if @formation_attendance.save
---
INSERT INTO "formation_attendances" ("user_id", "formation_id", "formation_session_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["formation_id", 10], ["formation_session_id", 1], ["created_at", "2020-12-01 10:19:42.170941"], ["updated_at", "2020-12-01 10:19:42.170941"]]

  def update
    if @formation_attendance.update(formation_attendance_params)
---
UPDATE "formation_attendances" SET "formation_session_id" = $1, "user_id" = $2, "updated_at" = $3 WHERE "formation_attendances"."id" = $4  [["formation_session_id", 10], ["user_id", 5], ["updated_at", "2020-12-01 10:05:46.327667"], ["id", 1]]

  def destroy
    @formation_attendance.destroy
---
DELETE FROM "formation_attendances" WHERE "formation_attendances"."id" = $1  [["id", 12]]

    def set_formation_attendance
      @formation_attendance = FormationAttendance.find(params[:id])
---
SELECT "formation_attendances".* FROM "formation_attendances" WHERE "formation_attendances"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def is_validated
      if User.find(current_user.id).is_validated
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]