app/controllers/api/formation_sessions_controller.rb

SELECT "formation_sessions".* FROM "formation_sessions"
---
  def index
    @formation_sessions = FormationSession.all