app/controllers/api/roles_controller.rb

  def create
    @role = Role.new(role_params)

    if @role.save
---
INSERT INTO "roles" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "teacher"], ["created_at", "2020-12-01 08:50:21.366281"], ["updated_at", "2020-12-01 08:50:21.366281"]]