app/controllers/api/rooms_controller.rb

  def create
    @room = Room.new(room_params)

    if @room.save
---
INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Salle 404"], ["created_at", "2020-12-01 08:53:05.674601"], ["updated_at", "2020-12-01 08:53:05.674601"]]