app/controllers/api/users_controller.rb

  def update
      if @user.update(user_params)
---
UPDATE "users" SET "first_name" = $1, "encrypted_password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "mamagique"], ["encrypted_password", "$2a$12$0cg0PfZIqRpPvWHZ7fI3AO9on7k7bT/meGMUS8V8/GkUncgw6.sE."], ["updated_at", "2020-12-01 09:07:38.254602"], ["id", 11]]